---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalElement.GetTransform
source: html/23e0c0f8-3f72-235e-0b1f-b977bbe5d697.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.GetTransform Method

Returns the transform which reflects Analytical Element orientation.

## Syntax (C#)
```csharp
public Transform GetTransform()
```

## Returns
The orientation of the Analytical Element.